export const rules=[
    {
        "id": 1,
        "name": "足球",
        "child": [
            {
                "id": 1,
                "name": "一般规则",
                "child": [
                    {
                        "id": 1,
                        "name": "一般规则"
                    }
                ]
            },
            {
                "id": 2,
                "name": "主要市场",
                "child": [
                    {
                        "id": 1,
                        "name": "让球"
                    },
                    {
                        "id": 2,
                        "name": "大小盘"
                    },
                    {
                        "id": 3,
                        "name": "1*2（独赢盘）"
                    },
                    {
                        "id": 4,
                        "name": "进球数－单／双"
                    },
                    {
                        "id": 5,
                        "name": "波胆"
                    },
                    {
                        "id": 6,
                        "name": "半场/全场"
                    },
                    {
                        "id": 7,
                        "name": "净胜球数"
                    },
                    {
                        "id": 8,
                        "name": "加时赛－净胜球数"
                    },
                    {
                        "id": 9,
                        "name": "双重机会"
                    },
                    {
                        "id": 10,
                        "name": "三项让球投注"
                    },
                    {
                        "id": 11,
                        "name": "落后反超获胜"
                    }
                ]
            },
            {
                "id": 3,
                "name": "进球集锦",
                "child": [
                    {
                        "id": 1,
                        "name": "总进球数"
                    },
                    {
                        "id": 2,
                        "name": "最先/最后进球球队"
                    },
                    {
                        "id": 3,
                        "name": "滚球 - 下一支进球"
                    },
                    {
                        "id": 4,
                        "name": "X 进球 (下一个进球)"
                    },
                    {
                        "id": 5,
                        "name": "双方球队进球 - 上半场"
                    },
                    {
                        "id": 6,
                        "name": "双方球队进球- 下半场"
                    },
                    {
                        "id": 7,
                        "name": "零失球"
                    },
                    {
                        "id": 8,
                        "name": "零失球获胜"
                    },
                    {
                        "id": 9,
                        "name": "先进2球/3球的一方"
                    },
                    {
                        "id": 10,
                        "name": "最多进球的半场"
                    },
                    {
                        "id": 11,
                        "name": "最多进球的半场 - 独赢"
                    },
                    {
                        "id": 12,
                        "name": "双半场进球"
                    },
                    {
                        "id": 13,
                        "name": "首个进球方式"
                    },
                    {
                        "id": 14,
                        "name": "首个进球时间-3项"
                    },
                    {
                        "id": 15,
                        "name": "首个进球方式"
                    },
                    {
                        "id": 16,
                        "name": "乌龙球"
                    }
                ]
            },
            {
                "id": 4,
                "name": "球员",
                "child": [
                    {
                        "id": 1,
                        "name": "一般规则（第一/最后/任何时间进球得分）"
                    },
                    {
                        "id": 2,
                        "name": "最先进球球员"
                    },
                    {
                        "id": 3,
                        "name": "最后进球球员"
                    },
                    {
                        "id": 4,
                        "name": "任何时间进球球员"
                    },
                    {
                        "id": 5,
                        "name": "球员特殊投注（进球数）"
                    }
                ]
            },
            {
                "id": 5,
                "name": "特别",
                "child": [
                    {
                        "id": 1,
                        "name": "开球球队"
                    },
                    {
                        "id": 2,
                        "name": "胜出方法"
                    },
                    {
                        "id": 3,
                        "name": "晋级方法"
                    },
                    {
                        "id": 4,
                        "name": "赢得所有半场"
                    },
                    {
                        "id": 5,
                        "name": "赢得任一半场"
                    },
                    {
                        "id": 6,
                        "name": "射正次数"
                    },
                    {
                        "id": 7,
                        "name": "上半场–第一个行动"
                    },
                    {
                        "id": 8,
                        "name": "下半场–第一个行动"
                    },
                    {
                        "id": 9,
                        "name": "半场伤停补时时间预测"
                    }
                ]
            },
            {
                "id": 6,
                "name": "角球",
                "child": [
                    {
                        "id": 1,
                        "name": "角球：一般规则"
                    },
                    {
                        "id": 2,
                        "name": "角球: 让球"
                    },
                    {
                        "id": 3,
                        "name": "角球: 让球 - 上半场"
                    },
                    {
                        "id": 4,
                        "name": "角球: 大/小"
                    },
                    {
                        "id": 5,
                        "name": "角球: 大 / 小 - 上半场"
                    },
                    {
                        "id": 6,
                        "name": "角球: 独赢"
                    },
                    {
                        "id": 7,
                        "name": "角球: 独赢 - 上半场"
                    },
                    {
                        "id": 8,
                        "name": "角球: 单 / 双"
                    },
                    {
                        "id": 9,
                        "name": "角球: 单 / 双 - 上半场"
                    },
                    {
                        "id": 10,
                        "name": "最先/最后角球"
                    },
                    {
                        "id": 11,
                        "name": "最多角球的半场"
                    },
                    {
                        "id": 12,
                        "name": "角球 - X角球"
                    },
                    {
                        "id": 13,
                        "name": "首个角球时间"
                    },
                    {
                        "id": 14,
                        "name": "15分钟角球数"
                    },
                    {
                        "id": 15,
                        "name": "角球双 - 双重机会"
                    }
                ]
            },
            {
                "id": 7,
                "name": "牌/卡",
                "child": [
                    {
                        "id": 1,
                        "name": "罚牌：一般规则"
                    },
                    {
                        "id": 2,
                        "name": "罚牌数: 让球"
                    },
                    {
                        "id": 3,
                        "name": "罚牌数: 让球 - 上半场"
                    },
                    {
                        "id": 4,
                        "name": "罚牌数: 大 / 小"
                    },
                    {
                        "id": 5,
                        "name": "罚牌数: 大 / 小 - 上半场"
                    },
                    {
                        "id": 6,
                        "name": "罚牌数: 独赢"
                    },
                    {
                        "id": 7,
                        "name": "罚牌数: 独赢 - 上半场"
                    },
                    {
                        "id": 8,
                        "name": "罚牌数: 单 / 双"
                    },
                    {
                        "id": 9,
                        "name": "罚牌数: 单 / 双 - 上半场"
                    },
                    {
                        "id": 10,
                        "name": "第一张/最后一张罚牌"
                    },
                    {
                        "id": 11,
                        "name": "罚牌 – X罚牌"
                    },
                    {
                        "id": 12,
                        "name": "罚牌最多的球队"
                    },
                    {
                        "id": 13,
                        "name": "第一张罚牌时间"
                    },
                    {
                        "id": 14,
                        "name": "红卡（球员）"
                    },
                    {
                        "id": 15,
                        "name": "罚牌 - 双重机会"
                    },
                    {
                        "id": 16,
                        "name": "15分钟罚牌数"
                    }
                ]
            },
            {
                "id": 8,
                "name": "任意球",
                "child": [
                    {
                        "id": 1,
                        "name": "最先/最后任意球"
                    }
                ]
            },
            {
                "id": 9,
                "name": "射门",
                "child": [
                    {
                        "id": 1,
                        "name": "最先/最后球门球"
                    }
                ]
            },
            {
                "id": 10,
                "name": "界外球",
                "child": [
                    {
                        "id": 1,
                        "name": "最先/最后界外球"
                    }
                ]
            },
            {
                "id": 11,
                "name": "替补",
                "child": [
                    {
                        "id": 1,
                        "name": "最先/最后替补"
                    }
                ]
            },
            {
                "id": 12,
                "name": "越位",
                "child": [
                    {
                        "id": 1,
                        "name": "最先/最后越位"
                    }
                ]
            },
            {
                "id": 13,
                "name": "点球",
                "child": [
                    {
                        "id": 1,
                        "name": "一般规则"
                    },
                    {
                        "id": 2,
                        "name": "点球荣获"
                    },
                    {
                        "id": 3,
                        "name": "点球大战 - 让球"
                    },
                    {
                        "id": 4,
                        "name": "点球大战 – 大小盘"
                    },
                    {
                        "id": 5,
                        "name": "点球大战 - 独赢"
                    },
                    {
                        "id": 6,
                        "name": "点球：进球/无进球"
                    },
                    {
                        "id": 7,
                        "name": "点球大战"
                    },
                    {
                        "id": 8,
                        "name": "点球大战 – X回合"
                    },
                    {
                        "id": 9,
                        "name": "点球大战 – 结束回合"
                    }
                ]
            },
            {
                "id": 14,
                "name": "联赛",
                "child": [
                    {
                        "id": 1,
                        "name": "联赛：一般规则"
                    },
                    {
                        "id": 2,
                        "name": "小组赛"
                    },
                    {
                        "id": 3,
                        "name": "排名前4、6、10等"
                    },
                    {
                        "id": 4,
                        "name": "没有球队X的联赛冠军"
                    },
                    {
                        "id": 5,
                        "name": "联赛：赛季让分盘"
                    },
                    {
                        "id": 6,
                        "name": "联赛：最后一名球队"
                    },
                    {
                        "id": 7,
                        "name": "联赛：被降级的球队"
                    },
                    {
                        "id": 8,
                        "name": "联赛：球队保持原位"
                    },
                    {
                        "id": 9,
                        "name": "联赛：球队晋级"
                    },
                    {
                        "id": 10,
                        "name": "联赛：最佳新秀"
                    },
                    {
                        "id": 11,
                        "name": "比赛 - 进球最多的球队"
                    },
                    {
                        "id": 12,
                        "name": "比赛 - 失球最多的球队"
                    },
                    {
                        "id": 13,
                        "name": "比赛 – 总进球数"
                    },
                    {
                        "id": 14,
                        "name": "比赛 - 帽子戏法"
                    },
                    {
                        "id": 15,
                        "name": "比赛 - 总帽子戏法"
                    },
                    {
                        "id": 16,
                        "name": "比赛 – 总红卡数"
                    },
                    {
                        "id": 17,
                        "name": "比赛 – 总黄卡数"
                    },
                    {
                        "id": 18,
                        "name": "比赛 – 进球最多的城市"
                    },
                    {
                        "id": 19,
                        "name": "比赛 – 获胜小组"
                    },
                    {
                        "id": 20,
                        "name": "锦标赛 – 小组最后一名球队"
                    },
                    {
                        "id": 21,
                        "name": "冠军所属地"
                    },
                    {
                        "id": 22,
                        "name": "比赛-晋级"
                    },
                    {
                        "id": 23,
                        "name": "比赛 - 阶段淘汰"
                    },
                    {
                        "id": 24,
                        "name": "比赛 - 提名入围。"
                    },
                    {
                        "id": 25,
                        "name": "比赛 – 最终裁判员"
                    },
                    {
                        "id": 26,
                        "name": "直接预测排名（联赛、比赛）"
                    },
                    {
                        "id": 27,
                        "name": "双预测排名"
                    },
                    {
                        "id": 28,
                        "name": "最佳射手"
                    },
                    {
                        "id": 29,
                        "name": "最佳射手球队"
                    },
                    {
                        "id": 30,
                        "name": "最佳射手/比赛双赢"
                    },
                    {
                        "id": 31,
                        "name": "进球最多的小组"
                    },
                    {
                        "id": 32,
                        "name": "加时赛"
                    },
                    {
                        "id": 33,
                        "name": "比赛-季军"
                    },
                    {
                        "id": 34,
                        "name": "比赛-分组赛冠军"
                    }
                ]
            },
            {
                "id": 15,
                "name": "综合市场",
                "child": [
                    {
                        "id": 1,
                        "name": "独赢 & 进球 大/小"
                    },
                    {
                        "id": 2,
                        "name": "独赢 & 双方球队进球"
                    },
                    {
                        "id": 3,
                        "name": "独赢 & 最先进球"
                    },
                    {
                        "id": 4,
                        "name": "独赢 & 进球 单/双"
                    },
                    {
                        "id": 5,
                        "name": "进球 大/小 & 双方球队进球"
                    },
                    {
                        "id": 6,
                        "name": "进球 大/小 & 进球 单/双"
                    },
                    {
                        "id": 7,
                        "name": "进球 大/小 & 最先进球"
                    },
                    {
                        "id": 8,
                        "name": "双重机会 & 进球 大/小"
                    },
                    {
                        "id": 9,
                        "name": "双重机会 & 双方球队进球"
                    }
                ]
            },
            {
                "id": 16,
                "name": "其它",
                "child": [
                    {
                        "id": 1,
                        "name": "特定联赛里主客队的总进球数"
                    }
                ]
            }
        ]
    },
    {
        "id": 2,
        "name": "篮球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让球"
            },
            {
                "id": 4,
                "name": "滚球让球"
            },
            {
                "id": 5,
                "name": "总分： 大 / 小"
            },
            {
                "id": 6,
                "name": "滚球总分： 大 / 小"
            },
            {
                "id": 7,
                "name": "球队得分 - 大 / 小"
            },
            {
                "id": 8,
                "name": "总分: 单 / 双"
            },
            {
                "id": 9,
                "name": "最先得分球队"
            },
            {
                "id": 10,
                "name": "最后得分球队"
            },
            {
                "id": 11,
                "name": "单节最高得分球队"
            },
            {
                "id": 12,
                "name": "每节最先获得20分的球队"
            },
            {
                "id": 13,
                "name": "篮球特别投注"
            },
            {
                "id": 14,
                "name": "球队得分 – 最后一位数"
            },
            {
                "id": 15,
                "name": "梦幻篮球游戏规则"
            }
        ]
    },
    {
        "id": 3,
        "name": "网球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让盘"
            },
            {
                "id": 4,
                "name": "让局"
            },
            {
                "id": 5,
                "name": "局获胜者（获胜者 – 盘X 局 X）"
            },
            {
                "id": 6,
                "name": "总局数： 大 / 小"
            },
            {
                "id": 7,
                "name": "总局数： 单 / 双"
            },
            {
                "id": 8,
                "name": "单盘投注"
            },
            {
                "id": 9,
                "name": "波胆"
            },
            {
                "id": 10,
                "name": "总分： 大 / 小"
            }
        ]
    },
    {
        "id": 4,
        "name": "电子竞技",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "冠军"
            },
            {
                "id": 3,
                "name": "让分"
            },
            {
                "id": 4,
                "name": "大/小"
            },
            {
                "id": 5,
                "name": "滚球"
            },
            {
                "id": 6,
                "name": "加注/特别投注"
            }
        ]
    },
    {
        "id": 5,
        "name": "板球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "对抗赛 & 郡級锦标赛"
            },
            {
                "id": 3,
                "name": "单日赛"
            },
            {
                "id": 4,
                "name": "独赢盘"
            },
            {
                "id": 5,
                "name": "1 x 2"
            },
            {
                "id": 6,
                "name": "和局"
            },
            {
                "id": 7,
                "name": "赢得发球权"
            },
            {
                "id": 8,
                "name": "最佳击球手"
            },
            {
                "id": 9,
                "name": "最佳投球手"
            },
            {
                "id": 10,
                "name": "最多四分的球队"
            },
            {
                "id": 11,
                "name": "最多六分的球队"
            },
            {
                "id": 12,
                "name": "最多得分的球队"
            },
            {
                "id": 13,
                "name": "配对选手开场得分最高的球队"
            },
            {
                "id": 14,
                "name": "首个三柱门被击倒前跑位得分/第X个三柱门被击倒前跑位得分"
            },
            {
                "id": 15,
                "name": "首个“三柱门”方式"
            },
            {
                "id": 16,
                "name": "下一位出局的球手"
            },
            {
                "id": 17,
                "name": "第一个投球跑位得分"
            },
            {
                "id": 18,
                "name": "球队得4分的总数"
            },
            {
                "id": 19,
                "name": "球队得6分的总数"
            },
            {
                "id": 20,
                "name": "球队得分的总数"
            },
            {
                "id": 21,
                "name": "球队总跑位得分两项投注（或三项投注）"
            },
            {
                "id": 22,
                "name": "X回合获得最多跑位得分的球队"
            },
            {
                "id": 23,
                "name": "首回合跑位得分（两项投注）"
            },
            {
                "id": 24,
                "name": "首回合最高跑位得分"
            },
            {
                "id": 25,
                "name": "球队全部出局"
            },
            {
                "id": 26,
                "name": "击球手投注"
            },
            {
                "id": 27,
                "name": "投球手投注"
            },
            {
                "id": 28,
                "name": "X回合跑位得分（两项投注）"
            },
            {
                "id": 29,
                "name": "X回合跑位得分（三项投注）"
            },
            {
                "id": 30,
                "name": "跑位得分总数两项投注（球员）"
            },
            {
                "id": 31,
                "name": "跑位得分总数三项投注（球员）"
            },
            {
                "id": 32,
                "name": "跑位得分50/100/150/200（球员）"
            },
            {
                "id": 33,
                "name": "出局方式（下个三柱门）"
            },
            {
                "id": 34,
                "name": "球队跑位总得分–单/双"
            },
            {
                "id": 35,
                "name": "首回合跑位得分–单/双"
            },
            {
                "id": 36,
                "name": "最多歪球次数"
            },
            {
                "id": 37,
                "name": "歪球的总数"
            },
            {
                "id": 38,
                "name": "被杀出局总数"
            },
            {
                "id": 39,
                "name": "最多击杀次数"
            },
            {
                "id": 40,
                "name": "击杀总数"
            },
            {
                "id": 41,
                "name": "最多零分"
            },
            {
                "id": 42,
                "name": "零分总数"
            },
            {
                "id": 43,
                "name": "第1局领先"
            },
            {
                "id": 44,
                "name": "跑位得分两项投注（或三项投注）"
            },
            {
                "id": 45,
                "name": "指定回合"
            },
            {
                "id": 46,
                "name": "甲级赛事"
            },
            {
                "id": 47,
                "name": "跑垒数"
            }
        ]
    },
    {
        "id": 6,
        "name": "棒球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让球"
            },
            {
                "id": 4,
                "name": "总得分:  大 / 小"
            },
            {
                "id": 5,
                "name": "滚球总得分: 大 / 小"
            },
            {
                "id": 6,
                "name": "总得分: 单 / 双"
            },
            {
                "id": 7,
                "name": "独赢 - 前5局"
            },
            {
                "id": 8,
                "name": "球队得分 - 大/小盘"
            },
            {
                "id": 9,
                "name": "净胜分数"
            },
            {
                "id": 10,
                "name": "加时赛"
            }
        ]
    },
    {
        "id": 7,
        "name": "冰球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "1 X 2"
            },
            {
                "id": 4,
                "name": "让球"
            },
            {
                "id": 5,
                "name": "滚球让球"
            },
            {
                "id": 6,
                "name": "大小盘"
            },
            {
                "id": 7,
                "name": "滚球大/小（球）"
            },
            {
                "id": 8,
                "name": "进球数－单／双"
            },
            {
                "id": 9,
                "name": "最先得分球队"
            },
            {
                "id": 10,
                "name": "最后得分球队"
            },
            {
                "id": 11,
                "name": "球队最高得分的赛节"
            }
        ]
    },
    {
        "id": 8,
        "name": "冬季运动 / 冬季奥运会 / 比赛",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "二选一对赛"
            },
            {
                "id": 3,
                "name": "冰壶"
            },
            {
                "id": 4,
                "name": "冬季两项赛"
            },
            {
                "id": 5,
                "name": "高山滑雪"
            }
        ]
    },
    {
        "id": 9,
        "name": "橄榄球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "冠军 （平局退款）"
            },
            {
                "id": 3,
                "name": "冠军（包括加时赛）"
            },
            {
                "id": 4,
                "name": "sportRule.1_2_single_winner_detail_3"
            },
            {
                "id": 5,
                "name": "sportRule.1_2_single_winner_detail_5"
            },
            {
                "id": 6,
                "name": "独赢 - 下半场"
            },
            {
                "id": 7,
                "name": "让球"
            },
            {
                "id": 8,
                "name": "sportRule.main_markets_detail_12"
            },
            {
                "id": 9,
                "name": "让球（包括加时赛）"
            },
            {
                "id": 10,
                "name": "总分： 大 / 小"
            },
            {
                "id": 11,
                "name": "总分: 大 / 小 - 上半场"
            },
            {
                "id": 12,
                "name": "总分 - 3项投注："
            },
            {
                "id": 13,
                "name": "球队得分：大/小"
            },
            {
                "id": 14,
                "name": "球队得分：大/小－上半场"
            },
            {
                "id": 15,
                "name": "主队得分：大/小－上半场"
            },
            {
                "id": 16,
                "name": "客队得分：大/小－上半场"
            },
            {
                "id": 17,
                "name": "触地得分"
            },
            {
                "id": 18,
                "name": "（触地得分后再把球射中球门的）附加得分"
            },
            {
                "id": 19,
                "name": "触地得分总分：大／小盘"
            },
            {
                "id": 20,
                "name": "触地得分（球队）：大／小盘"
            },
            {
                "id": 21,
                "name": "主队触地得分"
            },
            {
                "id": 22,
                "name": "客队触地得分"
            },
            {
                "id": 23,
                "name": "主队触地得分二分或更多"
            },
            {
                "id": 24,
                "name": "客队触地得分二分或更多"
            },
            {
                "id": 25,
                "name": "主队触地得分三分或更多"
            },
            {
                "id": 26,
                "name": "客队触地得分三分或更多"
            },
            {
                "id": 27,
                "name": "净胜分数（）"
            },
            {
                "id": 28,
                "name": "首个触地得分球员"
            },
            {
                "id": 29,
                "name": "最后触地得分球员"
            },
            {
                "id": 30,
                "name": "触地得分球员"
            },
            {
                "id": 31,
                "name": "首个触地得分球队"
            },
            {
                "id": 32,
                "name": "最后触地得分球队"
            },
            {
                "id": 33,
                "name": "首个得分球队"
            },
            {
                "id": 34,
                "name": "最后得分球队"
            }
        ]
    },
    {
        "id": 10,
        "name": "高尔夫球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "冠军投注"
            },
            {
                "id": 3,
                "name": "配对赛/2球/3球(18洞)"
            },
            {
                "id": 4,
                "name": "配对赛/2球/3球(72洞/锦标赛配对投注)"
            },
            {
                "id": 5,
                "name": "下一个洞的分数-单个选手市场"
            },
            {
                "id": 6,
                "name": "让球"
            },
            {
                "id": 7,
                "name": "大/小盘（分数）"
            },
            {
                "id": 8,
                "name": "前5名/前10名"
            },
            {
                "id": 9,
                "name": "净胜分数"
            }
        ]
    },
    {
        "id": 11,
        "name": "金融投注",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            }
        ]
    },
    {
        "id": 12,
        "name": "连串过关 / 连串过关 / 组合过关",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "连串过关"
            },
            {
                "id": 3,
                "name": "连串投注种类"
            }
        ]
    },
    {
        "id": 13,
        "name": "美式足球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让球"
            },
            {
                "id": 4,
                "name": "滚球让球"
            },
            {
                "id": 5,
                "name": "大/小"
            },
            {
                "id": 6,
                "name": "大/小（滾球盤）"
            },
            {
                "id": 7,
                "name": "单/双"
            },
            {
                "id": 8,
                "name": "半场/全场"
            },
            {
                "id": 9,
                "name": "净胜分数"
            },
            {
                "id": 10,
                "name": "最先得分球队"
            },
            {
                "id": 11,
                "name": "最后得分球队"
            },
            {
                "id": 12,
                "name": "单节最高得分球队"
            },
            {
                "id": 13,
                "name": "每节最先获得10分的球队"
            }
        ]
    },
    {
        "id": 14,
        "name": "排球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让盘 / 让局"
            },
            {
                "id": 4,
                "name": "总盘/总局数：大 / 小"
            },
            {
                "id": 5,
                "name": "让分"
            },
            {
                "id": 6,
                "name": "总分： 大 / 小"
            },
            {
                "id": 7,
                "name": "单盘投注"
            },
            {
                "id": 8,
                "name": "波胆"
            },
            {
                "id": 9,
                "name": "波胆"
            },
            {
                "id": 10,
                "name": "单/双"
            }
        ]
    },
    {
        "id": 15,
        "name": "乒乓球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让盘 / 让局"
            },
            {
                "id": 4,
                "name": "总盘/总局数：大 / 小"
            },
            {
                "id": 5,
                "name": "让分"
            },
            {
                "id": 6,
                "name": "总分： 大 / 小"
            },
            {
                "id": 7,
                "name": "单盘投注"
            },
            {
                "id": 8,
                "name": "球员/球队得分 -大/小"
            },
            {
                "id": 9,
                "name": "波胆"
            },
            {
                "id": 10,
                "name": "单/双"
            }
        ]
    },
    {
        "id": 16,
        "name": "曲棍球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "1 X 2"
            },
            {
                "id": 3,
                "name": "让球"
            },
            {
                "id": 4,
                "name": "滚球让球"
            },
            {
                "id": 5,
                "name": "大/小"
            },
            {
                "id": 6,
                "name": "大/小（滾球盤）"
            },
            {
                "id": 7,
                "name": "单/双"
            }
        ]
    },
    {
        "id": 17,
        "name": "拳击/搏斗",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "一般规则"
            }
        ]
    },
    {
        "id": 18,
        "name": "赛车",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "二选一投注"
            },
            {
                "id": 4,
                "name": "最快圈"
            },
            {
                "id": 5,
                "name": "最快圈( X圈或X–Y圈)"
            },
            {
                "id": 6,
                "name": "迖成成绩或排名之车手数"
            },
            {
                "id": 7,
                "name": "安全车"
            },
            {
                "id": 8,
                "name": "Top X"
            },
            {
                "id": 9,
                "name": "净胜分数"
            },
            {
                "id": 10,
                "name": "车队冠军"
            },
            {
                "id": 11,
                "name": "前X名车队"
            },
            {
                "id": 12,
                "name": "退出盘"
            },
            {
                "id": 13,
                "name": "圈X退出比赛总数"
            },
            {
                "id": 14,
                "name": "进维修站盘"
            },
            {
                "id": 15,
                "name": "超车盘"
            },
            {
                "id": 16,
                "name": "完成比赛的车手总数"
            },
            {
                "id": 17,
                "name": "获胜者的起跑排位"
            },
            {
                "id": 18,
                "name": "赛组冠军"
            },
            {
                "id": 19,
                "name": "单/双"
            }
        ]
    },
    {
        "id": 19,
        "name": "沙滩排球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让局"
            },
            {
                "id": 4,
                "name": "让分"
            },
            {
                "id": 5,
                "name": "总分： 大 / 小"
            },
            {
                "id": 6,
                "name": "单/双"
            }
        ]
    },
    {
        "id": 20,
        "name": "沙滩足球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让球"
            },
            {
                "id": 4,
                "name": "滚球让球"
            },
            {
                "id": 5,
                "name": "总分： 大 / 小"
            }
        ]
    },
    {
        "id": 21,
        "name": "手球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "1 X 2"
            },
            {
                "id": 3,
                "name": "滚球让球"
            },
            {
                "id": 4,
                "name": "大/小"
            },
            {
                "id": 5,
                "name": "让球"
            },
            {
                "id": 6,
                "name": "大/小（滾球盤）"
            },
            {
                "id": 7,
                "name": "单/双"
            }
        ]
    },
    {
        "id": 22,
        "name": "斯诺克/台球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让球"
            },
            {
                "id": 4,
                "name": "大/小"
            },
            {
                "id": 5,
                "name": "单/双"
            },
            {
                "id": 6,
                "name": "Frame Betting"
            },
            {
                "id": 7,
                "name": "‘Play All’ Matches"
            }
        ]
    },
    {
        "id": 23,
        "name": "体操",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            }
        ]
    },
    {
        "id": 24,
        "name": "田径",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            }
        ]
    },
    {
        "id": 25,
        "name": "羽毛球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "总分获胜者（获胜者 – 局X 分数 X）"
            },
            {
                "id": 4,
                "name": "让盘 / 让局"
            },
            {
                "id": 5,
                "name": "总盘/总局数：大 / 小"
            },
            {
                "id": 6,
                "name": "让分"
            },
            {
                "id": 7,
                "name": "总分： 大 / 小"
            },
            {
                "id": 8,
                "name": "球员/球队得分 -大/小"
            },
            {
                "id": 9,
                "name": "球队得分 - 大 / 小"
            },
            {
                "id": 10,
                "name": "波胆"
            },
            {
                "id": 11,
                "name": "单/双"
            }
        ]
    },
    {
        "id": 26,
        "name": "自行车",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "二选一投注"
            }
        ]
    },
    {
        "id": 27,
        "name": "真人游戏规则",
        "child": [
            {
                "id": 1,
                "name": "轮盘简介"
            },
            {
                "id": 2,
                "name": "百家乐简介"
            },
            {
                "id": 3,
                "name": "骰宝简介"
            }
        ]
    },
    {
        "id": 28,
        "name": "电子游戏规则",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            }
        ]
    }
]