export const Announcement = [
  {
    "AnnouncementId": 111992,
    "PostingDate": "2025-07-30T09:08:32.0000000-04:00",
    "ExpiryDate": "2025-07-31T09:08:32.0000000-04:00",
    "DateUpdated": "2025-07-30T09:10:18.0072436-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[足球][新加坡国家足球甲级联赛] '尚泰水手-vs-新加坡板球俱乐部' - 30/07. *直播。由于直播中断，这场赛事将从网页删除。造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111993,
    "PostingDate": "2025-07-30T09:05:10.0000000-04:00",
    "ExpiryDate": "2025-07-31T09:05:10.0000000-04:00",
    "DateUpdated": "2025-07-30T09:13:43.5434285-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[篮球][中国CYBL U21] '辽宁本钢U21-vs-山东高速麒麟U21' - 30/07. *直播。由于直播中断，这场赛事将从网页删除。(包括第三节)。 造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111991,
    "PostingDate": "2025-07-30T08:28:14.0000000-04:00",
    "ExpiryDate": "2025-07-31T08:28:14.0000000-04:00",
    "DateUpdated": "2025-07-30T08:30:06.6926798-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[足球][澳大利亚新南威尔斯北区超级联赛] '新兰顿FC-vs-亚登斯顿' - 30/07. 赛事延迟，所有注单将被退款。连串注单以(1)计算。请重新检查注单与账户余额，造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111990,
    "PostingDate": "2025-07-30T08:23:10.0000000-04:00",
    "ExpiryDate": "2025-07-31T08:23:10.0000000-04:00",
    "DateUpdated": "2025-07-30T08:23:59.7888370-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[拳击 / 综合格斗][职业拳击] '亨特.伊奥内-vs-肯.艾特肯' - 30/07. 赛果将进一步核实，直至另行通知正确赛果，造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111985,
    "PostingDate": "2025-07-30T06:41:32.0000000-04:00",
    "ExpiryDate": "2025-07-31T06:41:32.0000000-04:00",
    "DateUpdated": "2025-07-30T06:45:38.0423077-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[网球][ATP - 捷克利贝雷茨挑战赛 - 男单] '詹纳罗.阿尔贝托.奥利维埃里-vs-亚历克斯.巴瑞娜' - 30/07. 由于球员在第二盘退出比赛,  所有注单将被退款。(除了已结算输赢的注单)。请重新检查注单与账户余额，造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111984,
    "PostingDate": "2025-07-30T06:30:50.0000000-04:00",
    "ExpiryDate": "2025-07-31T06:30:50.0000000-04:00",
    "DateUpdated": "2025-07-30T06:33:34.7515211-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[网球][ATP - 哈萨克斯坦阿斯塔纳挑战赛 - 男单] '亚里科桑德雷.巴克希-vs-姆昆.萨西库马' - 30/07. 由于恶劣的天气条件导致这场赛事中断，将根据比赛日程重新开赛。 造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111982,
    "PostingDate": "2025-07-30T06:13:37.0000000-04:00",
    "ExpiryDate": "2025-07-31T06:13:37.0000000-04:00",
    "DateUpdated": "2025-07-30T06:15:42.3246705-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[篮球][国际友谊赛 - 第一节] '巴西-vs-新西兰' - 30/07. 由于赛事结果错误显示，所有注单将被再次处理。正确的赛事结果是[21-31]而不是[21-30]。请重新检查注单与账户余额，造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111981,
    "PostingDate": "2025-07-30T05:54:55.0000000-04:00",
    "ExpiryDate": "2025-08-06T05:54:00.0000000-04:00",
    "DateUpdated": "2025-07-30T05:55:28.4119216-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[足球][俱乐部友谊赛] '欧帕提亚-vs-杜布拉瓦' - 30/07. 赛果将进一步核实，直至另行通知正确赛果，造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111983,
    "PostingDate": "2025-07-30T05:24:07.0000000-04:00",
    "ExpiryDate": "2025-07-31T05:24:07.0000000-04:00",
    "DateUpdated": "2025-07-30T06:29:15.6263657-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[篮球][MPBL - 马哈利卡菲律宾篮球联赛] '瓦尔城魔术队-vs-布拉干库亚什' - 30/07. *直播。由于直播中断，这场赛事将从网页删除。造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111980,
    "PostingDate": "2025-07-30T05:20:59.0000000-04:00",
    "ExpiryDate": "2025-07-31T05:20:59.0000000-04:00",
    "DateUpdated": "2025-07-30T05:45:29.3549419-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[篮球][中国全运会资格赛(第三节)] '江苏-vs-新疆' - 30/07. 由于赛事结果错误显示，所有注单将被再次处理。正确的第三节赛事结果是[18-11]而不是[16-11]和第四节正确赛事结果是[15-15]而不是[17-15]。请重新检查注单与账户余额，造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111979,
    "PostingDate": "2025-07-30T03:58:48.0000000-04:00",
    "ExpiryDate": "2025-07-31T03:58:48.0000000-04:00",
    "DateUpdated": "2025-07-30T03:59:39.4134675-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[足球][俱乐部友谊赛] '欧帕提亚-vs-杜布拉瓦' - 30/07. *直播。由于直播中断，这场赛事将从网页删除。造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111976,
    "PostingDate": "2025-07-29T22:37:24.0000000-04:00",
    "ExpiryDate": "2025-07-30T22:37:24.0000000-04:00",
    "DateUpdated": "2025-07-30T08:28:36.3379790-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[足球][巴西甲级联赛 - 角球] '甘美奧 - 角球总数-vs-福塔雷萨 - 角球总数' - 29/07. 由于错误显示赛果,所有注单将被再次处理。全场的正确赛果是[2-5]而不是[2-6]。请重新检查注单与账户余额。 造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111975,
    "PostingDate": "2025-07-29T21:23:23.0000000-04:00",
    "ExpiryDate": "2025-07-30T21:23:23.0000000-04:00",
    "DateUpdated": "2025-07-29T21:24:20.6700812-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[网球][ATP - 美国列克星敦挑战赛 - 男单] '劳埃德.哈里斯-vs-马克.拉哈尔' - 29/07. 由于球员在第二盘退出比赛, 所有注单将被退款。(除了已结算输赢的注单)。请重新检查注单与账户余额，造成不便之处，敬请谅解！\r\n"
      }
    ]
  },
  {
    "AnnouncementId": 111974,
    "PostingDate": "2025-07-29T19:31:00.0000000-04:00",
    "ExpiryDate": "2025-07-30T19:31:00.0000000-04:00",
    "DateUpdated": "2025-07-29T20:26:19.4044087-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[网络足球][IM独家 FIFA 22 德国甲级联赛] '法兰克福-vs-莱比锡红牛' - 29/07.由于技术问题导致在上半场第42分钟中断 [1-0]，所有注单将被退款，(除了那些已经确定输赢的注单)。连串注单以(1)计算。请重新检查您的投注单与账户结余，造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111971,
    "PostingDate": "2025-07-29T16:11:01.0000000-04:00",
    "ExpiryDate": "2025-07-30T16:11:01.0000000-04:00",
    "DateUpdated": "2025-07-29T16:11:55.4338070-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[网络篮球][IM独家 世界篮球 2K21] '阿根廷-vs-德国' - 29/07. 由于错误显示分数, 所有注单将被再次处理。全场的正确赛果是[124-129]而不是[121-129]，第四节的正确赛果是[31-41]而不是[28-41]。请请重新检查注单与账户余额，造成不便之处，敬请谅解！\r\n"
      }
    ]
  },
  {
    "AnnouncementId": 111970,
    "PostingDate": "2025-07-29T15:45:28.0000000-04:00",
    "ExpiryDate": "2025-07-30T15:45:28.0000000-04:00",
    "DateUpdated": "2025-07-29T15:45:48.9314497-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[足球][北爱尔兰女子超级联赛] '沙姆洛克流浪者(女)-vs-瓦特福(女)' - 29/07. *直播。由于直播中断，这场赛事将从网页删除。造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111969,
    "PostingDate": "2025-07-29T15:10:59.0000000-04:00",
    "ExpiryDate": "2025-07-30T15:10:59.0000000-04:00",
    "DateUpdated": "2025-07-29T15:11:29.5110267-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[足球][加勒比海联盟俱乐部盾杯(在特立尼达&多巴哥)] '阿内特花园-vs-AC西班牙港' - 29/07. *直播。由于直播中断，这场赛事将从网页删除。造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111968,
    "PostingDate": "2025-07-29T15:09:01.0000000-04:00",
    "ExpiryDate": "2025-07-30T15:09:01.0000000-04:00",
    "DateUpdated": "2025-07-29T15:09:23.1593835-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[足球][俱乐部友谊赛] '纽维城-vs-拉夫格尔' - 29/07. *直播。由于直播中断，这场赛事将从网页删除。造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111967,
    "PostingDate": "2025-07-29T14:39:28.0000000-04:00",
    "ExpiryDate": "2025-07-30T14:39:28.0000000-04:00",
    "DateUpdated": "2025-07-29T14:48:52.4043739-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[网球][UTR专业网球系列赛大学城02 - 男单] '亚历杭德罗.埃尔南德斯.古铁雷斯-vs-里特什.帕蒂尔' - 29/07. 由于球员在第三盘退出比赛, 所有注单将被退款。(除了已结算输赢的注单) 。请重新检查注单与账户余额。 造成不便之处，敬请谅解！\t\t\t\t\t"
      }
    ]
  },
  {
    "AnnouncementId": 111966,
    "PostingDate": "2025-07-29T14:19:59.0000000-04:00",
    "ExpiryDate": "2025-07-30T14:19:59.0000000-04:00",
    "DateUpdated": "2025-07-29T14:20:42.2151523-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[足球][芬兰女子联赛] 'VIFK瓦萨(女)-vs-PK 35赫尔辛基(女)' - 29/07. 赛果将进一步核实，直至另行通知正确赛果，造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111964,
    "PostingDate": "2025-07-29T13:29:24.0000000-04:00",
    "ExpiryDate": "2025-07-30T13:29:24.0000000-04:00",
    "DateUpdated": "2025-07-29T13:30:14.8169880-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[网球][WTA - 加拿大蒙特利尔 - 女单] '米拉.安德烈耶娃-vs-比安卡.安德里斯库' - 29/07. 由于有球员退出比赛，所有注单将被退款。请重新检查注单与账户余额，造成不便之处，敬请谅解！"
      }
    ]
  },
  {
    "AnnouncementId": 111963,
    "PostingDate": "2025-07-29T13:08:12.0000000-04:00",
    "ExpiryDate": "2025-07-30T13:08:12.0000000-04:00",
    "DateUpdated": "2025-07-29T13:12:31.9537959-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[网球][ATP - 美国列克星敦挑战赛 - 男单] '松田龍樹-vs-奥马尔.贾斯卡' - 29/07. 由于球员在第三盘退出比赛, 所有注单将被退款。(除了已结算输赢的注单) 。请重新检查注单与账户余额。 造成不便之处，敬请谅解!"
      }
    ]
  },
  {
    "AnnouncementId": 111962,
    "PostingDate": "2025-07-29T12:46:23.0000000-04:00",
    "ExpiryDate": "2025-07-30T12:46:23.0000000-04:00",
    "DateUpdated": "2025-07-29T12:46:53.7048629-04:00",
    "AnnouncementDetail": [
      {
        "LanguageCode": "CHS",
        "Content": "[足球][芬兰女子联赛] 'VIFK瓦萨(女)-vs-PK 35赫尔辛基(女)' - 29/07. *直播。由于直播中断，这场赛事将从网页删除。造成不便之处，敬请谅解！"
      }
    ]
  }
]
export const bashatiyu=[
  {
    "messageId": 2444062,
    "postTime": "2025-07-29T20:36:21.657",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"劳艾德-哈里斯(南非) -vs- 马克-拉贾尔(爱沙尼亚)\" [ATP 挑战赛 - 列克星敦公开赛 - 29/7], 所有投注金额已被退还 (第一盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2443780,
    "postTime": "2025-07-29T17:31:34.883",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者 [比安卡-安德莱斯库(加拿大)] 弃权, [WTA - 国家银行公开赛 - 29/7], 所有投注金额已被退还. 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2443719,
    "postTime": "2025-07-29T16:30:03.293",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"奥斯卡-何塞-古铁雷斯(西班牙) -vs- 亚历山德罗-巴蒂斯顿(意大利)\" [ITF - M15哈蒂瓦 男子单打 - 29/7], 所有投注金额已被退还 (第一盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2443715,
    "postTime": "2025-07-29T16:25:21.9",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"露西亚-科尔特斯-洛尔卡(西班牙) -vs- 梅丽莎-埃尔坎(澳洲)\" [ITF - W100马斯帕洛马斯大加那利岛女子单打 - 29/7], 所有投注金额已被退还 (第一和第二盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2443677,
    "postTime": "2025-07-29T15:41:20.177",
    "isSticky": false,
    "message": "请注意:[足球] 经审查赛事, \"曼联 (PG) -vs- 利物浦 (PG)\" [沙巴足球台Max - 英超联赛 - 29/7] 所有投注金额已被退还. 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2443260,
    "postTime": "2025-07-29T11:39:05.18",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"拉卢卡-乔治亚娜-塞尔班(塞浦路斯) -vs- 卡洛塔-马丁内斯-齐雷斯(西班牙)\" [ITF - W75 科尔德农斯 女子单打 - 29/7], 所有投注金额已被退还 (第一和第二盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2443268,
    "postTime": "2025-07-29T11:42:10.6",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者更换, \"埃米利奥-纳瓦(美国) -vs- 雨果-亨伯特(法国)\" [ATP - 国家银行公开赛 - 29/7]. 所有投注金额已被退还. 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2443287,
    "postTime": "2025-07-29T11:55:09.86",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"吉尔伯托-拉瓦西奥(意大利) -vs- 贾萨-萨伊里奇(波兰)\" [ITF - M25科沙林 男子单打 - 29/7], 所有投注金额已被退还 (投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2443289,
    "postTime": "2025-07-29T11:55:11.68",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"德斯皮纳-帕帕米查尔(希腊) -vs- 阿里泽-琳(法国)\" [ITF - W35克诺克海斯特 女子单打 - 29/7], 所有投注金额已被退还 (第一盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2443344,
    "postTime": "2025-07-29T12:14:11.643",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者 [斯蒂金-帕德库珀] 弃权, [UTR职业网球系列赛大学城男子单打 - 29/7], 所有投注金额已被退还. 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2443409,
    "postTime": "2025-07-29T12:39:04.7",
    "isSticky": false,
    "message": "请注意:[足球]由于卫星电讯中断,\"VIFK瓦萨 (女) -vs- PK-35 赫尔辛基 (女)\" [芬兰女子国家联赛 - 29/7*走地*] 本公司将无法进行现场走地. 不便之处 敬请见谅!"
  },
  {
    "messageId": 2443465,
    "postTime": "2025-07-29T13:12:41.543",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"吉尔-阿诺-贝利(比利时) -vs- 米卡莱-哈利亚克\" [ITF - M25韦茨拉尔 男子单打 - 29/7], 所有投注金额已被退还 (投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2443542,
    "postTime": "2025-07-29T13:50:01.3",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"松田龙树(日本) -vs- 奥马尔-雅西卡(澳洲)\" [ATP 挑战赛 - 列克星敦公开赛 - 29/7], 所有投注金额已被退还 (第一和第二盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2443669,
    "postTime": "2025-07-29T15:31:31.763",
    "isSticky": false,
    "message": "请注意:[足球] 由于卫星电讯中断,\"特伦奈特 -vs- 巴域克\" [苏格兰低地足球联赛 - 29/7*走地*] 本公司大约于 30/7 3:20:17 AM - 3:25:03 AM (北京时间) 面对卫星电讯中断. 所有被影响等待中而无法接受的注单已被取消. 不便之处 敬请见谅!\t\r\n"
  },
  {
    "messageId": 2443675,
    "postTime": "2025-07-29T15:39:20.477",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"亚历杭德罗-埃尔南德斯-古铁雷斯 -vs- 瑞泰什-帕蒂尔\" [UTR职业网球系列赛大学城男子单打 - 29/7], 所有投注金额已被退还 (第一和第二盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2440124,
    "postTime": "2025-07-28T15:19:13.423",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"艾丹-马约(美国) -vs- 马丁-达姆(美国)\" [ATP 挑战赛 - 列克星敦公开赛 - 28/7], 所有投注金额已被退还 (第一和第二盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2440141,
    "postTime": "2025-07-28T15:27:26.453",
    "isSticky": false,
    "message": "请注意:[足球] 由于卫星电讯中断,\"蒙特维多竞技 (后) -vs- 艾比安 (后)\" [乌拉圭后备中级锦标赛 - 28/7*走地*] 本公司大约于 29/7 3:17:35 AM - 3:20:17 AM (北京时间) 面对卫星电讯中断. 所有被影响等待中而无法接受的注单已被取消. 不便之处 敬请见谅!\t\r\n"
  },
  {
    "messageId": 2440203,
    "postTime": "2025-07-28T16:45:08.93",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"吴东霖(中华台北) -vs- 松田龙树(日本)\" [ATP 挑战赛 - 列克星敦公开赛 - 28/7], 所有投注金额已被退还 (第一盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2440260,
    "postTime": "2025-07-28T17:48:13.35",
    "isSticky": false,
    "message": "请注意:[足球]由于赛事时间不正规 (2 X 60 分钟),\"摩里伦斯 -vs- 查维斯\" [球会友谊赛 - 26/7] 所有投注金额已被退还. 串关以(1)计算. 不便之处 敬请见谅!\r\n"
  },
  {
    "messageId": 2440335,
    "postTime": "2025-07-28T18:45:48.183",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"罗伯托-卡巴列罗巴耶纳(西班牙) -vs- 卡米洛-乌戈-卡拉贝利(阿根廷)\" [ATP - 国家银行公开赛 - 28/7], 所有投注金额已被退还 (第一盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2440507,
    "postTime": "2025-07-28T20:24:37.76",
    "isSticky": false,
    "message": "请注意:[网球] 因赛事取消, \"杰弗里-布兰克尼奥克斯(法国)/哈罗德-马约(法国) -vs- 南智惺(韩国)/健-结月(日本)\" [男子双打挑战赛 - 楚格公开赛 - 27/7], 所有投注金额已被退还 (第一盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2440519,
    "postTime": "2025-07-28T20:32:43.35",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"斯蒂金-帕德库珀 -vs- 布罗迪-内耶德利-克拉尔\" [UTR职业网球系列赛大学城男子单打 - 28/7], 所有投注金额已被退还 (第一盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2440574,
    "postTime": "2025-07-28T20:58:06.953",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"尼古拉斯-梅希亚(哥伦比亚) -vs- 奥古斯特-霍尔姆格伦(丹麦)\" [ATP 挑战赛 - 列克星敦公开赛 - 28/7], 所有投注金额已被退还 (第一和第二盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2440694,
    "postTime": "2025-07-28T21:46:42.063",
    "isSticky": false,
    "message": "请注意:[足球] 因赛事取消 \"潘塞拉高斯 -vs- 乌罗舍瓦茨\" [球会友谊赛 - 28/7] 所有投注金额已被退还. 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2441121,
    "postTime": "2025-07-29T00:37:17.213",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"Sungbeen Sim (韩国) -vs- Zhengyu Sun(中国)\" [ITF - M15武宁 男子单打 - 28/7], 所有投注金额已被退还 (第一盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2441129,
    "postTime": "2025-07-29T00:39:40.55",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"Yong Joon Park(韩国) -vs- 康苏普-康加卡(泰国)\" [ITF - M15那坤巴统府 男子单打 - 28/7], 所有投注金额已被退还 (第一和第二盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2441159,
    "postTime": "2025-07-29T00:55:24.29",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"阿基拉-桑迪兰(澳洲) -vs- 悉达特-拉瓦特(印度)\" [ITF - M15那坤巴统府 男子单打 - 28/7], 所有投注金额已被退还 (投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2441195,
    "postTime": "2025-07-29T01:07:21.347",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"乾祐一郎(日本) -vs- 曾耀杰(中国)\" [ITF - M15武宁 男子单打 - 28/7], 所有投注金额已被退还 (第一盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2441325,
    "postTime": "2025-07-29T02:18:35.293",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者 [内森-博尼尔] 弃权, [UTR职业网球系列赛 洛夫代尔 男子单打 - 28/7], 所有投注金额已被退还. 串关以(1)计算. 谢谢!\r\n"
  },
  {
    "messageId": 2441379,
    "postTime": "2025-07-29T02:54:12.113",
    "isSticky": false,
    "message": "请注意:[足球] [2:15PM] \"鸿岭河静虚拟队 -vs- 岘港FC虚拟队\" [沙巴越南甲组联赛虚拟PES 24 - 15分钟赛事 - 29/7] 于上半场之后, 因技术问题中断, 所有投注金额已被退还 (上半场及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!\r\n"
  },
  {
    "messageId": 2441556,
    "postTime": "2025-07-29T04:20:01.223",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"孙浅 -vs- 陈醒道(中国) \" [ITF - M15武宁 男子单打 - 29/7], 所有投注金额已被退还 (第一盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2441563,
    "postTime": "2025-07-29T04:24:19.73",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"刘汉屹(中国) -vs- 蒂莫菲-德雷帕斯科\" [ITF - M15武宁 男子单打 - 29/7], 所有投注金额已被退还 (投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2441912,
    "postTime": "2025-07-29T06:32:29.887",
    "isSticky": false,
    "message": "请注意:[篮球]由于卫星电讯中断,\"辽宁飞豹 U21 -vs- 天津先行者 U21\" [中国U21青年篮球联赛 - 29/7*走地*] 本公司将无法进行现场走地. 不便之处 敬请见谅!"
  },
  {
    "messageId": 2442076,
    "postTime": "2025-07-29T07:21:54.763",
    "isSticky": false,
    "message": "请注意:[电子竞技] 由于官方宣佈该赛事 \"⁠wangting -vs- ⁠HELL PIGS\" [英雄联盟 - PCS 第三赛季 - 29/7] 由 \"⁠⁠HELL PIGS\" 获胜. 因对方弃权. 所有投注金额已被退还. 串关以(1)计算. 谢谢!\t\t"
  },
  {
    "messageId": 2442544,
    "postTime": "2025-07-29T08:57:46.83",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"尼可拉斯-阿尔瓦雷斯-瓦罗纳(西班牙) -vs- 马蒂亚斯-索托(智利)\" [ATP 挑战赛 - 波尔图公开赛 - 29/7], 所有投注金额已被退还 (第一和第二盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2436692,
    "postTime": "2025-07-28T00:07:23.75",
    "isSticky": false,
    "message": "请注意:[足球] 由于赛事细节在调查当中, 赛事 \"摩里伦斯 -vs- 查维斯\" [球会友谊赛 - 26/7] 有关帐目将会调至 28/7 (美东时间). 包括有被影响的特别投注产品. 请预览赛果以得知更多详情. 不便之处 敬请见谅!"
  },
  {
    "messageId": 2436695,
    "postTime": "2025-07-28T00:07:32.39",
    "isSticky": false,
    "message": "请注意:[足球] 由于赛事细节在调查当中, 赛事 \"马斯梅赫伦 -vs- RKC瓦尔韦克\" [球会友谊赛 - 26/7] 有关帐目将会调至 28/7 (美东时间). 包括有被影响的特别投注产品. 请预览赛果以得知更多详情. 不便之处 敬请见谅!"
  },
  {
    "messageId": 2436751,
    "postTime": "2025-07-28T00:12:09.62",
    "isSticky": false,
    "message": "请注意:[足球] 因赛事改期 \"卡达根拿 -vs- 利昂內斯\" [哥伦比亚乙组联赛 - 27/7] 所有投注金额已被退还. 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2437528,
    "postTime": "2025-07-28T02:09:19.787",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"阿尔琼迈罗特拉(澳洲) -vs- 伊姆兰丹尼尔阿贝德哈扎利(马来西亚)\" [ITF - M15那坤巴统府 男子单打 - 27/7], 所有投注金额已被退还 (第一和第二盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2437980,
    "postTime": "2025-07-28T04:19:18.56",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者 [迪奥尔丹-马卡巴巴德(澳洲)] 弃权, [ITF - M15巴厘 男子单打 - 27/7], 所有投注金额已被退还. 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2438230,
    "postTime": "2025-07-28T05:32:04.017",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者更换, \"亚历山大-布洛克斯(比利时) -vs- 卢西亚诺-达代里(意大利)\" [ATP - 国家银行公开赛 - 28/7]. 所有投注金额已被退还. 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2438546,
    "postTime": "2025-07-28T07:03:46.163",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"阿丽娜-查拉耶娃 -vs- 阿纳斯塔西娅-库利科娃(芬兰)\" [WTA - 波兰公开赛 - 28/7], 所有投注金额已被退还 (第一和第二盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2438775,
    "postTime": "2025-07-28T08:05:25.65",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"亚历山大-宾达(意大利) -vs- 彼得-巴尔-比柳科夫\" [ATP 挑战赛 - 总统杯 - 28/7], 所有投注金额已被退还 (第一盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2438971,
    "postTime": "2025-07-28T08:52:03.107",
    "isSticky": false,
    "message": "请注意:[足球] 经审查赛事, \"虚拟 柏林 (PG) -vs- 虚拟 伦敦 (PG)\" [沙巴足球台 - 虚拟联赛 - 28/7] 所有投注金额已被退还. 串关以(1)计算. 谢谢!\r\n"
  },
  {
    "messageId": 2439165,
    "postTime": "2025-07-28T09:34:06.103",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"弗拉德-克里斯蒂安-布雷亚祖(罗马尼亚) -vs- 爱德华多-切丽-利尼埃(意大利)\" [ITF - M25皮特什蒂 男子单打 - 28/7], 所有投注金额已被退还 (第一盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2439654,
    "postTime": "2025-07-28T11:23:42.88",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"查里-彭曼 -vs- 皮特-斯蒂夫克\" [UTR职业网球系列赛 门兴格拉德巴赫 男子单打 - 28/7], 所有投注金额已被退还 (第一和第二盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  },
  {
    "messageId": 2440037,
    "postTime": "2025-07-28T14:16:40.75",
    "isSticky": false,
    "message": "请注意:[足球]由于卫星电讯中断,\"马拉肯查 (中) -vs- 雅各布曼苏尔\" [球会友谊赛 - 28/7*走地*] 本公司将无法进行现场走地. 不便之处 敬请见谅!"
  },
  {
    "messageId": 2440117,
    "postTime": "2025-07-28T15:16:15.33",
    "isSticky": false,
    "message": "请注意:[网球] 因参赛者受伤, \"马蒂亚-贝鲁奇(意大利) -vs- 雨果-加斯顿(法国)\" [ATP - 国家银行公开赛 - 28/7], 所有投注金额已被退还 (第一和第二盘获胜者及投注结果已确定输赢除外). 串关以(1)计算. 谢谢!"
  }
]

export const touzhuguize = [
    {
        "id": 1,
        "name": "足球",
        "child": [
            {
                "id": 1,
                "name": "一般规则",
                "child": [
                    {
                        "id": 1,
                        "name": "一般规则"
                    }
                ]
            },
            {
                "id": 2,
                "name": "主要市场",
                "child": [
                    {
                        "id": 1,
                        "name": "让球"
                    },
                    {
                        "id": 2,
                        "name": "大小盘"
                    },
                    {
                        "id": 3,
                        "name": "1*2（独赢盘）"
                    },
                    {
                        "id": 4,
                        "name": "进球数－单／双"
                    },
                    {
                        "id": 5,
                        "name": "波胆"
                    },
                    {
                        "id": 6,
                        "name": "半场/全场"
                    },
                    {
                        "id": 7,
                        "name": "净胜球数"
                    },
                    {
                        "id": 8,
                        "name": "加时赛－净胜球数"
                    },
                    {
                        "id": 9,
                        "name": "双重机会"
                    },
                    {
                        "id": 10,
                        "name": "三项让球投注"
                    },
                    {
                        "id": 11,
                        "name": "落后反超获胜"
                    }
                ]
            },
            {
                "id": 3,
                "name": "进球集锦",
                "child": [
                    {
                        "id": 1,
                        "name": "总进球数"
                    },
                    {
                        "id": 2,
                        "name": "最先/最后进球球队"
                    },
                    {
                        "id": 3,
                        "name": "滚球 - 下一支进球"
                    },
                    {
                        "id": 4,
                        "name": "X 进球 (下一个进球)"
                    },
                    {
                        "id": 5,
                        "name": "双方球队进球 - 上半场"
                    },
                    {
                        "id": 6,
                        "name": "双方球队进球- 下半场"
                    },
                    {
                        "id": 7,
                        "name": "零失球"
                    },
                    {
                        "id": 8,
                        "name": "零失球获胜"
                    },
                    {
                        "id": 9,
                        "name": "先进2球/3球的一方"
                    },
                    {
                        "id": 10,
                        "name": "最多进球的半场"
                    },
                    {
                        "id": 11,
                        "name": "最多进球的半场 - 独赢"
                    },
                    {
                        "id": 12,
                        "name": "双半场进球"
                    },
                    {
                        "id": 13,
                        "name": "首个进球方式"
                    },
                    {
                        "id": 14,
                        "name": "首个进球时间-3项"
                    },
                    {
                        "id": 15,
                        "name": "首个进球方式"
                    },
                    {
                        "id": 16,
                        "name": "乌龙球"
                    }
                ]
            },
            {
                "id": 4,
                "name": "球员",
                "child": [
                    {
                        "id": 1,
                        "name": "一般规则（第一/最后/任何时间进球得分）"
                    },
                    {
                        "id": 2,
                        "name": "最先进球球员"
                    },
                    {
                        "id": 3,
                        "name": "最后进球球员"
                    },
                    {
                        "id": 4,
                        "name": "任何时间进球球员"
                    },
                    {
                        "id": 5,
                        "name": "球员特殊投注（进球数）"
                    }
                ]
            },
            {
                "id": 5,
                "name": "特别",
                "child": [
                    {
                        "id": 1,
                        "name": "开球球队"
                    },
                    {
                        "id": 2,
                        "name": "胜出方法"
                    },
                    {
                        "id": 3,
                        "name": "晋级方法"
                    },
                    {
                        "id": 4,
                        "name": "赢得所有半场"
                    },
                    {
                        "id": 5,
                        "name": "赢得任一半场"
                    },
                    {
                        "id": 6,
                        "name": "射正次数"
                    },
                    {
                        "id": 7,
                        "name": "上半场–第一个行动"
                    },
                    {
                        "id": 8,
                        "name": "下半场–第一个行动"
                    },
                    {
                        "id": 9,
                        "name": "半场伤停补时时间预测"
                    }
                ]
            },
            {
                "id": 6,
                "name": "角球",
                "child": [
                    {
                        "id": 1,
                        "name": "角球：一般规则"
                    },
                    {
                        "id": 2,
                        "name": "角球: 让球"
                    },
                    {
                        "id": 3,
                        "name": "角球: 让球 - 上半场"
                    },
                    {
                        "id": 4,
                        "name": "角球: 大/小"
                    },
                    {
                        "id": 5,
                        "name": "角球: 大 / 小 - 上半场"
                    },
                    {
                        "id": 6,
                        "name": "角球: 独赢"
                    },
                    {
                        "id": 7,
                        "name": "角球: 独赢 - 上半场"
                    },
                    {
                        "id": 8,
                        "name": "角球: 单 / 双"
                    },
                    {
                        "id": 9,
                        "name": "角球: 单 / 双 - 上半场"
                    },
                    {
                        "id": 10,
                        "name": "最先/最后角球"
                    },
                    {
                        "id": 11,
                        "name": "最多角球的半场"
                    },
                    {
                        "id": 12,
                        "name": "角球 - X角球"
                    },
                    {
                        "id": 13,
                        "name": "首个角球时间"
                    },
                    {
                        "id": 14,
                        "name": "15分钟角球数"
                    },
                    {
                        "id": 15,
                        "name": "角球双 - 双重机会"
                    }
                ]
            },
            {
                "id": 7,
                "name": "牌/卡",
                "child": [
                    {
                        "id": 1,
                        "name": "罚牌：一般规则"
                    },
                    {
                        "id": 2,
                        "name": "罚牌数: 让球"
                    },
                    {
                        "id": 3,
                        "name": "罚牌数: 让球 - 上半场"
                    },
                    {
                        "id": 4,
                        "name": "罚牌数: 大 / 小"
                    },
                    {
                        "id": 5,
                        "name": "罚牌数: 大 / 小 - 上半场"
                    },
                    {
                        "id": 6,
                        "name": "罚牌数: 独赢"
                    },
                    {
                        "id": 7,
                        "name": "罚牌数: 独赢 - 上半场"
                    },
                    {
                        "id": 8,
                        "name": "罚牌数: 单 / 双"
                    },
                    {
                        "id": 9,
                        "name": "罚牌数: 单 / 双 - 上半场"
                    },
                    {
                        "id": 10,
                        "name": "第一张/最后一张罚牌"
                    },
                    {
                        "id": 11,
                        "name": "罚牌 – X罚牌"
                    },
                    {
                        "id": 12,
                        "name": "罚牌最多的球队"
                    },
                    {
                        "id": 13,
                        "name": "第一张罚牌时间"
                    },
                    {
                        "id": 14,
                        "name": "红卡（球员）"
                    },
                    {
                        "id": 15,
                        "name": "罚牌 - 双重机会"
                    },
                    {
                        "id": 16,
                        "name": "15分钟罚牌数"
                    }
                ]
            },
            {
                "id": 8,
                "name": "任意球",
                "child": [
                    {
                        "id": 1,
                        "name": "最先/最后任意球"
                    }
                ]
            },
            {
                "id": 9,
                "name": "射门",
                "child": [
                    {
                        "id": 1,
                        "name": "最先/最后球门球"
                    }
                ]
            },
            {
                "id": 10,
                "name": "界外球",
                "child": [
                    {
                        "id": 1,
                        "name": "最先/最后界外球"
                    }
                ]
            },
            {
                "id": 11,
                "name": "替补",
                "child": [
                    {
                        "id": 1,
                        "name": "最先/最后替补"
                    }
                ]
            },
            {
                "id": 12,
                "name": "越位",
                "child": [
                    {
                        "id": 1,
                        "name": "最先/最后越位"
                    }
                ]
            },
            {
                "id": 13,
                "name": "点球",
                "child": [
                    {
                        "id": 1,
                        "name": "一般规则"
                    },
                    {
                        "id": 2,
                        "name": "点球荣获"
                    },
                    {
                        "id": 3,
                        "name": "点球大战 - 让球"
                    },
                    {
                        "id": 4,
                        "name": "点球大战 – 大小盘"
                    },
                    {
                        "id": 5,
                        "name": "点球大战 - 独赢"
                    },
                    {
                        "id": 6,
                        "name": "点球：进球/无进球"
                    },
                    {
                        "id": 7,
                        "name": "点球大战"
                    },
                    {
                        "id": 8,
                        "name": "点球大战 – X回合"
                    },
                    {
                        "id": 9,
                        "name": "点球大战 – 结束回合"
                    }
                ]
            },
            {
                "id": 14,
                "name": "联赛",
                "child": [
                    {
                        "id": 1,
                        "name": "联赛：一般规则"
                    },
                    {
                        "id": 2,
                        "name": "小组赛"
                    },
                    {
                        "id": 3,
                        "name": "排名前4、6、10等"
                    },
                    {
                        "id": 4,
                        "name": "没有球队X的联赛冠军"
                    },
                    {
                        "id": 5,
                        "name": "联赛：赛季让分盘"
                    },
                    {
                        "id": 6,
                        "name": "联赛：最后一名球队"
                    },
                    {
                        "id": 7,
                        "name": "联赛：被降级的球队"
                    },
                    {
                        "id": 8,
                        "name": "联赛：球队保持原位"
                    },
                    {
                        "id": 9,
                        "name": "联赛：球队晋级"
                    },
                    {
                        "id": 10,
                        "name": "联赛：最佳新秀"
                    },
                    {
                        "id": 11,
                        "name": "比赛 - 进球最多的球队"
                    },
                    {
                        "id": 12,
                        "name": "比赛 - 失球最多的球队"
                    },
                    {
                        "id": 13,
                        "name": "比赛 – 总进球数"
                    },
                    {
                        "id": 14,
                        "name": "比赛 - 帽子戏法"
                    },
                    {
                        "id": 15,
                        "name": "比赛 - 总帽子戏法"
                    },
                    {
                        "id": 16,
                        "name": "比赛 – 总红卡数"
                    },
                    {
                        "id": 17,
                        "name": "比赛 – 总黄卡数"
                    },
                    {
                        "id": 18,
                        "name": "比赛 – 进球最多的城市"
                    },
                    {
                        "id": 19,
                        "name": "比赛 – 获胜小组"
                    },
                    {
                        "id": 20,
                        "name": "锦标赛 – 小组最后一名球队"
                    },
                    {
                        "id": 21,
                        "name": "冠军所属地"
                    },
                    {
                        "id": 22,
                        "name": "比赛-晋级"
                    },
                    {
                        "id": 23,
                        "name": "比赛 - 阶段淘汰"
                    },
                    {
                        "id": 24,
                        "name": "比赛 - 提名入围。"
                    },
                    {
                        "id": 25,
                        "name": "比赛 – 最终裁判员"
                    },
                    {
                        "id": 26,
                        "name": "直接预测排名（联赛、比赛）"
                    },
                    {
                        "id": 27,
                        "name": "双预测排名"
                    },
                    {
                        "id": 28,
                        "name": "最佳射手"
                    },
                    {
                        "id": 29,
                        "name": "最佳射手球队"
                    },
                    {
                        "id": 30,
                        "name": "最佳射手/比赛双赢"
                    },
                    {
                        "id": 31,
                        "name": "进球最多的小组"
                    },
                    {
                        "id": 32,
                        "name": "加时赛"
                    },
                    {
                        "id": 33,
                        "name": "比赛-季军"
                    },
                    {
                        "id": 34,
                        "name": "比赛-分组赛冠军"
                    }
                ]
            },
            {
                "id": 15,
                "name": "综合市场",
                "child": [
                    {
                        "id": 1,
                        "name": "独赢 & 进球 大/小"
                    },
                    {
                        "id": 2,
                        "name": "独赢 & 双方球队进球"
                    },
                    {
                        "id": 3,
                        "name": "独赢 & 最先进球"
                    },
                    {
                        "id": 4,
                        "name": "独赢 & 进球 单/双"
                    },
                    {
                        "id": 5,
                        "name": "进球 大/小 & 双方球队进球"
                    },
                    {
                        "id": 6,
                        "name": "进球 大/小 & 进球 单/双"
                    },
                    {
                        "id": 7,
                        "name": "进球 大/小 & 最先进球"
                    },
                    {
                        "id": 8,
                        "name": "双重机会 & 进球 大/小"
                    },
                    {
                        "id": 9,
                        "name": "双重机会 & 双方球队进球"
                    }
                ]
            },
            {
                "id": 16,
                "name": "其它",
                "child": [
                    {
                        "id": 1,
                        "name": "特定联赛里主客队的总进球数"
                    }
                ]
            }
        ]
    },
    {
        "id": 2,
        "name": "篮球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让球"
            },
            {
                "id": 4,
                "name": "滚球让球"
            },
            {
                "id": 5,
                "name": "总分： 大 / 小"
            },
            {
                "id": 6,
                "name": "滚球总分： 大 / 小"
            },
            {
                "id": 7,
                "name": "球队得分 - 大 / 小"
            },
            {
                "id": 8,
                "name": "总分: 单 / 双"
            },
            {
                "id": 9,
                "name": "最先得分球队"
            },
            {
                "id": 10,
                "name": "最后得分球队"
            },
            {
                "id": 11,
                "name": "单节最高得分球队"
            },
            {
                "id": 12,
                "name": "每节最先获得20分的球队"
            },
            {
                "id": 13,
                "name": "篮球特别投注"
            },
            {
                "id": 14,
                "name": "球队得分 – 最后一位数"
            },
            {
                "id": 15,
                "name": "梦幻篮球游戏规则"
            }
        ]
    },
    {
        "id": 3,
        "name": "网球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让盘"
            },
            {
                "id": 4,
                "name": "让局"
            },
            {
                "id": 5,
                "name": "局获胜者（获胜者 – 盘X 局 X）"
            },
            {
                "id": 6,
                "name": "总局数： 大 / 小"
            },
            {
                "id": 7,
                "name": "总局数： 单 / 双"
            },
            {
                "id": 8,
                "name": "单盘投注"
            },
            {
                "id": 9,
                "name": "波胆"
            },
            {
                "id": 10,
                "name": "总分： 大 / 小"
            }
        ]
    },
    {
        "id": 4,
        "name": "电子竞技",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "冠军"
            },
            {
                "id": 3,
                "name": "让分"
            },
            {
                "id": 4,
                "name": "大/小"
            },
            {
                "id": 5,
                "name": "滚球"
            },
            {
                "id": 6,
                "name": "加注/特别投注"
            }
        ]
    },
    {
        "id": 5,
        "name": "板球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "对抗赛 & 郡級锦标赛"
            },
            {
                "id": 3,
                "name": "单日赛"
            },
            {
                "id": 4,
                "name": "独赢盘"
            },
            {
                "id": 5,
                "name": "1 x 2"
            },
            {
                "id": 6,
                "name": "和局"
            },
            {
                "id": 7,
                "name": "赢得发球权"
            },
            {
                "id": 8,
                "name": "最佳击球手"
            },
            {
                "id": 9,
                "name": "最佳投球手"
            },
            {
                "id": 10,
                "name": "最多四分的球队"
            },
            {
                "id": 11,
                "name": "最多六分的球队"
            },
            {
                "id": 12,
                "name": "最多得分的球队"
            },
            {
                "id": 13,
                "name": "配对选手开场得分最高的球队"
            },
            {
                "id": 14,
                "name": "首个三柱门被击倒前跑位得分/第X个三柱门被击倒前跑位得分"
            },
            {
                "id": 15,
                "name": "首个“三柱门”方式"
            },
            {
                "id": 16,
                "name": "下一位出局的球手"
            },
            {
                "id": 17,
                "name": "第一个投球跑位得分"
            },
            {
                "id": 18,
                "name": "球队得4分的总数"
            },
            {
                "id": 19,
                "name": "球队得6分的总数"
            },
            {
                "id": 20,
                "name": "球队得分的总数"
            },
            {
                "id": 21,
                "name": "球队总跑位得分两项投注（或三项投注）"
            },
            {
                "id": 22,
                "name": "X回合获得最多跑位得分的球队"
            },
            {
                "id": 23,
                "name": "首回合跑位得分（两项投注）"
            },
            {
                "id": 24,
                "name": "首回合最高跑位得分"
            },
            {
                "id": 25,
                "name": "球队全部出局"
            },
            {
                "id": 26,
                "name": "击球手投注"
            },
            {
                "id": 27,
                "name": "投球手投注"
            },
            {
                "id": 28,
                "name": "X回合跑位得分（两项投注）"
            },
            {
                "id": 29,
                "name": "X回合跑位得分（三项投注）"
            },
            {
                "id": 30,
                "name": "跑位得分总数两项投注（球员）"
            },
            {
                "id": 31,
                "name": "跑位得分总数三项投注（球员）"
            },
            {
                "id": 32,
                "name": "跑位得分50/100/150/200（球员）"
            },
            {
                "id": 33,
                "name": "出局方式（下个三柱门）"
            },
            {
                "id": 34,
                "name": "球队跑位总得分–单/双"
            },
            {
                "id": 35,
                "name": "首回合跑位得分–单/双"
            },
            {
                "id": 36,
                "name": "最多歪球次数"
            },
            {
                "id": 37,
                "name": "歪球的总数"
            },
            {
                "id": 38,
                "name": "被杀出局总数"
            },
            {
                "id": 39,
                "name": "最多击杀次数"
            },
            {
                "id": 40,
                "name": "击杀总数"
            },
            {
                "id": 41,
                "name": "最多零分"
            },
            {
                "id": 42,
                "name": "零分总数"
            },
            {
                "id": 43,
                "name": "第1局领先"
            },
            {
                "id": 44,
                "name": "跑位得分两项投注（或三项投注）"
            },
            {
                "id": 45,
                "name": "指定回合"
            },
            {
                "id": 46,
                "name": "甲级赛事"
            },
            {
                "id": 47,
                "name": "跑垒数"
            }
        ]
    },
    {
        "id": 6,
        "name": "棒球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让球"
            },
            {
                "id": 4,
                "name": "总得分:  大 / 小"
            },
            {
                "id": 5,
                "name": "滚球总得分: 大 / 小"
            },
            {
                "id": 6,
                "name": "总得分: 单 / 双"
            },
            {
                "id": 7,
                "name": "独赢 - 前5局"
            },
            {
                "id": 8,
                "name": "球队得分 - 大/小盘"
            },
            {
                "id": 9,
                "name": "净胜分数"
            },
            {
                "id": 10,
                "name": "加时赛"
            }
        ]
    },
    {
        "id": 7,
        "name": "冰球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "1 X 2"
            },
            {
                "id": 4,
                "name": "让球"
            },
            {
                "id": 5,
                "name": "滚球让球"
            },
            {
                "id": 6,
                "name": "大小盘"
            },
            {
                "id": 7,
                "name": "滚球大/小（球）"
            },
            {
                "id": 8,
                "name": "进球数－单／双"
            },
            {
                "id": 9,
                "name": "最先得分球队"
            },
            {
                "id": 10,
                "name": "最后得分球队"
            },
            {
                "id": 11,
                "name": "球队最高得分的赛节"
            }
        ]
    },
    {
        "id": 8,
        "name": "冬季运动 / 冬季奥运会 / 比赛",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "二选一对赛"
            },
            {
                "id": 3,
                "name": "冰壶"
            },
            {
                "id": 4,
                "name": "冬季两项赛"
            },
            {
                "id": 5,
                "name": "高山滑雪"
            }
        ]
    },
    {
        "id": 9,
        "name": "橄榄球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "冠军 （平局退款）"
            },
            {
                "id": 3,
                "name": "冠军（包括加时赛）"
            },
            {
                "id": 4,
                "name": "sportRule.1_2_single_winner_detail_3"
            },
            {
                "id": 5,
                "name": "sportRule.1_2_single_winner_detail_5"
            },
            {
                "id": 6,
                "name": "独赢 - 下半场"
            },
            {
                "id": 7,
                "name": "让球"
            },
            {
                "id": 8,
                "name": "sportRule.main_markets_detail_12"
            },
            {
                "id": 9,
                "name": "让球（包括加时赛）"
            },
            {
                "id": 10,
                "name": "总分： 大 / 小"
            },
            {
                "id": 11,
                "name": "总分: 大 / 小 - 上半场"
            },
            {
                "id": 12,
                "name": "总分 - 3项投注："
            },
            {
                "id": 13,
                "name": "球队得分：大/小"
            },
            {
                "id": 14,
                "name": "球队得分：大/小－上半场"
            },
            {
                "id": 15,
                "name": "主队得分：大/小－上半场"
            },
            {
                "id": 16,
                "name": "客队得分：大/小－上半场"
            },
            {
                "id": 17,
                "name": "触地得分"
            },
            {
                "id": 18,
                "name": "（触地得分后再把球射中球门的）附加得分"
            },
            {
                "id": 19,
                "name": "触地得分总分：大／小盘"
            },
            {
                "id": 20,
                "name": "触地得分（球队）：大／小盘"
            },
            {
                "id": 21,
                "name": "主队触地得分"
            },
            {
                "id": 22,
                "name": "客队触地得分"
            },
            {
                "id": 23,
                "name": "主队触地得分二分或更多"
            },
            {
                "id": 24,
                "name": "客队触地得分二分或更多"
            },
            {
                "id": 25,
                "name": "主队触地得分三分或更多"
            },
            {
                "id": 26,
                "name": "客队触地得分三分或更多"
            },
            {
                "id": 27,
                "name": "净胜分数（）"
            },
            {
                "id": 28,
                "name": "首个触地得分球员"
            },
            {
                "id": 29,
                "name": "最后触地得分球员"
            },
            {
                "id": 30,
                "name": "触地得分球员"
            },
            {
                "id": 31,
                "name": "首个触地得分球队"
            },
            {
                "id": 32,
                "name": "最后触地得分球队"
            },
            {
                "id": 33,
                "name": "首个得分球队"
            },
            {
                "id": 34,
                "name": "最后得分球队"
            }
        ]
    },
    {
        "id": 10,
        "name": "高尔夫球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "冠军投注"
            },
            {
                "id": 3,
                "name": "配对赛/2球/3球(18洞)"
            },
            {
                "id": 4,
                "name": "配对赛/2球/3球(72洞/锦标赛配对投注)"
            },
            {
                "id": 5,
                "name": "下一个洞的分数-单个选手市场"
            },
            {
                "id": 6,
                "name": "让球"
            },
            {
                "id": 7,
                "name": "大/小盘（分数）"
            },
            {
                "id": 8,
                "name": "前5名/前10名"
            },
            {
                "id": 9,
                "name": "净胜分数"
            }
        ]
    },
    {
        "id": 11,
        "name": "金融投注",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            }
        ]
    },
    {
        "id": 12,
        "name": "连串过关 / 连串过关 / 组合过关",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "连串过关"
            },
            {
                "id": 3,
                "name": "连串投注种类"
            }
        ]
    },
    {
        "id": 13,
        "name": "美式足球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让球"
            },
            {
                "id": 4,
                "name": "滚球让球"
            },
            {
                "id": 5,
                "name": "大/小"
            },
            {
                "id": 6,
                "name": "大/小（滾球盤）"
            },
            {
                "id": 7,
                "name": "单/双"
            },
            {
                "id": 8,
                "name": "半场/全场"
            },
            {
                "id": 9,
                "name": "净胜分数"
            },
            {
                "id": 10,
                "name": "最先得分球队"
            },
            {
                "id": 11,
                "name": "最后得分球队"
            },
            {
                "id": 12,
                "name": "单节最高得分球队"
            },
            {
                "id": 13,
                "name": "每节最先获得10分的球队"
            }
        ]
    },
    {
        "id": 14,
        "name": "排球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让盘 / 让局"
            },
            {
                "id": 4,
                "name": "总盘/总局数：大 / 小"
            },
            {
                "id": 5,
                "name": "让分"
            },
            {
                "id": 6,
                "name": "总分： 大 / 小"
            },
            {
                "id": 7,
                "name": "单盘投注"
            },
            {
                "id": 8,
                "name": "波胆"
            },
            {
                "id": 9,
                "name": "波胆"
            },
            {
                "id": 10,
                "name": "单/双"
            }
        ]
    },
    {
        "id": 15,
        "name": "乒乓球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让盘 / 让局"
            },
            {
                "id": 4,
                "name": "总盘/总局数：大 / 小"
            },
            {
                "id": 5,
                "name": "让分"
            },
            {
                "id": 6,
                "name": "总分： 大 / 小"
            },
            {
                "id": 7,
                "name": "单盘投注"
            },
            {
                "id": 8,
                "name": "球员/球队得分 -大/小"
            },
            {
                "id": 9,
                "name": "波胆"
            },
            {
                "id": 10,
                "name": "单/双"
            }
        ]
    },
    {
        "id": 16,
        "name": "曲棍球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "1 X 2"
            },
            {
                "id": 3,
                "name": "让球"
            },
            {
                "id": 4,
                "name": "滚球让球"
            },
            {
                "id": 5,
                "name": "大/小"
            },
            {
                "id": 6,
                "name": "大/小（滾球盤）"
            },
            {
                "id": 7,
                "name": "单/双"
            }
        ]
    },
    {
        "id": 17,
        "name": "拳击/搏斗",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "一般规则"
            }
        ]
    },
    {
        "id": 18,
        "name": "赛车",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "二选一投注"
            },
            {
                "id": 4,
                "name": "最快圈"
            },
            {
                "id": 5,
                "name": "最快圈( X圈或X–Y圈)"
            },
            {
                "id": 6,
                "name": "迖成成绩或排名之车手数"
            },
            {
                "id": 7,
                "name": "安全车"
            },
            {
                "id": 8,
                "name": "Top X"
            },
            {
                "id": 9,
                "name": "净胜分数"
            },
            {
                "id": 10,
                "name": "车队冠军"
            },
            {
                "id": 11,
                "name": "前X名车队"
            },
            {
                "id": 12,
                "name": "退出盘"
            },
            {
                "id": 13,
                "name": "圈X退出比赛总数"
            },
            {
                "id": 14,
                "name": "进维修站盘"
            },
            {
                "id": 15,
                "name": "超车盘"
            },
            {
                "id": 16,
                "name": "完成比赛的车手总数"
            },
            {
                "id": 17,
                "name": "获胜者的起跑排位"
            },
            {
                "id": 18,
                "name": "赛组冠军"
            },
            {
                "id": 19,
                "name": "单/双"
            }
        ]
    },
    {
        "id": 19,
        "name": "沙滩排球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让局"
            },
            {
                "id": 4,
                "name": "让分"
            },
            {
                "id": 5,
                "name": "总分： 大 / 小"
            },
            {
                "id": 6,
                "name": "单/双"
            }
        ]
    },
    {
        "id": 20,
        "name": "沙滩足球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让球"
            },
            {
                "id": 4,
                "name": "滚球让球"
            },
            {
                "id": 5,
                "name": "总分： 大 / 小"
            }
        ]
    },
    {
        "id": 21,
        "name": "手球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "1 X 2"
            },
            {
                "id": 3,
                "name": "滚球让球"
            },
            {
                "id": 4,
                "name": "大/小"
            },
            {
                "id": 5,
                "name": "让球"
            },
            {
                "id": 6,
                "name": "大/小（滾球盤）"
            },
            {
                "id": 7,
                "name": "单/双"
            }
        ]
    },
    {
        "id": 22,
        "name": "斯诺克/台球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "让球"
            },
            {
                "id": 4,
                "name": "大/小"
            },
            {
                "id": 5,
                "name": "单/双"
            },
            {
                "id": 6,
                "name": "Frame Betting"
            },
            {
                "id": 7,
                "name": "‘Play All’ Matches"
            }
        ]
    },
    {
        "id": 23,
        "name": "体操",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            }
        ]
    },
    {
        "id": 24,
        "name": "田径",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            }
        ]
    },
    {
        "id": 25,
        "name": "羽毛球",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "独赢盘"
            },
            {
                "id": 3,
                "name": "总分获胜者（获胜者 – 局X 分数 X）"
            },
            {
                "id": 4,
                "name": "让盘 / 让局"
            },
            {
                "id": 5,
                "name": "总盘/总局数：大 / 小"
            },
            {
                "id": 6,
                "name": "让分"
            },
            {
                "id": 7,
                "name": "总分： 大 / 小"
            },
            {
                "id": 8,
                "name": "球员/球队得分 -大/小"
            },
            {
                "id": 9,
                "name": "球队得分 - 大 / 小"
            },
            {
                "id": 10,
                "name": "波胆"
            },
            {
                "id": 11,
                "name": "单/双"
            }
        ]
    },
    {
        "id": 26,
        "name": "自行车",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            },
            {
                "id": 2,
                "name": "二选一投注"
            }
        ]
    },
    {
        "id": 27,
        "name": "真人游戏规则",
        "child": [
            {
                "id": 1,
                "name": "轮盘简介"
            },
            {
                "id": 2,
                "name": "百家乐简介"
            },
            {
                "id": 3,
                "name": "骰宝简介"
            }
        ]
    },
    {
        "id": 28,
        "name": "电子游戏规则",
        "child": [
            {
                "id": 1,
                "name": "一般规则"
            }
        ]
    }
]